src/Documents/ТехническийПроект/ТехническийПроект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТехническийПроект</name>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Изменения</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияСОбъектами</types>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>CatalogRef.ТипыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ОбъектыМетаданных</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектВладелец</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Платформа</name>
      <type>
        <types>CatalogRef.Платформы</types>
      </type>
    </attributes>
    <attributes>
      <name>НетИзмененийМетаданных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОбъекта</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
        <types>ChartOfCharacteristicTypesRef.ВопросыАнкетОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаПрав</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Удалить_Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>CatalogRef.ИзмененияМатрицыПрав</types>
      </type>
    </attributes>
    <attributes>
      <name>Право</name>
      <type>
        <types>CatalogRef.Права</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ДействияСОбъектами/ДействияСОбъектами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДействияСОбъектами</name>
  <predefined>
    <items>
      <name>Добавление</name>
      <description>Добавление</description>
    </items>
    <items>
      <name>Изменение</name>
      <description>Изменение</description>
    </items>
    <items>
      <name>Удаление</name>
      <description>Удаление</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>1000</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <tabularSections>
    <name>ТипыОбъектов</name>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>CatalogRef.ТипыОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСОбъектами</name>
    <attributes>
      <name>ДействиеСОбъектом</name>
      <type>
        <types>CatalogRef.ДействияСОбъектами</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/Documents/ТехническийПроект/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Строка Из объект.Изменения Цикл
		Строка.ТипОбъектаПредыдущий = Строка.ТипОбъекта;
	КонецЦикла;
	
КонецПроцедуры

#Область ТабличнаяЧастьИзменения
&НаКлиенте
Процедура ИзмененияОбъектПриИзменении(Элемент)
	
	ТекДанные = Элементы.Изменения.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Объект) И ТипЗнч(ТекДанные.Объект) = Тип("СправочникСсылка.ОбъектыМетаданных") Тогда
		Реквизиты = ЗначениеРеквизитовОбъекта(ТекДанные.Объект, "ТипОбъекта,Владелец,Владелец.Платформа");
		ТекДанные.ТипОбъекта = Реквизиты.ТипОбъекта;
		ТекДанные.Конфигурация = Реквизиты.Владелец;
		ТекДанные.Платформа = Реквизиты.ВладелецПлатформа;
	КонецЕсли;
	
КонецПроцедуры

//При Добавлении объект вводится строкой в остальных случаях выбирается из справочника
&НаКлиенте
Процедура ИзмененияПередНачаломИзменения(Элемент, Отказ)
	
	УстановитьДоступныетипыПоляОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияДействиеПриИзменении(Элемент)
	
	УстановитьДоступныетипыПоляОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступныетипыПоляОбъект()
	
	ТекущиеДанные = Элементы.Изменения.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Действие) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Справочник.ДействияСОбъектами.Добавление") Тогда
	 	 М = Новый Массив;
		 М.Добавить(Тип("Строка"));
         Элементы.ИзмененияОбъект.ОграничениеТипа = Новый ОписаниеТипов(М);
	Иначе
		 М = Новый Массив;
		 М.Добавить(Тип("СправочникСсылка.ОбъектыМетаданных"));
	     Элементы.ИзмененияОбъект.ОграничениеТипа = Новый ОписаниеТипов(М);
	КонецЕсли; 
	ТекущиеДанные.Объект = Элементы.ИзмененияОбъект.ОграничениеТипа.Привестизначение(ТекущиеДанные.Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитовОбъекта(Ссылка, Реквизиты)
	Возврат Новый ФиксированнаяСтруктура(ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты));	
КонецФункции

&НаКлиенте
Процедура ИзмененияКонфигурацияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Изменения.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Конфигурация)  Тогда
		Реквизиты = ЗначениеРеквизитовОбъекта(ТекДанные.Конфигурация, "Платформа");
		ТекДанные.Платформа = Реквизиты.Платформа;		
	Иначе
		ТекДанные.Платформа = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзмененияОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ОбъектыМетаданных.ФормаВыбора", Новый Структура("Отбор",Новый Структура("Владелец", Элементы.Изменения.ТекущиеДанные.Конфигурация)),Элемент);
КонецПроцедуры

#КонецОбласти

#Область ТабличнаяЧастьКонфигурации
&НаКлиенте
Процедура КонфигурацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СписокВыбора = Элементы.ИзмененияКонфигурация.СписокВыбора;
	СписокВыбора.Очистить();
	Если Объект.Конфигурации.Количество() = 0 Тогда
		СписокВыбора.Добавить("<Выберите конфигурации>");
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаКонфигурация Из Объект.Конфигурации Цикл
		СписокВыбора.Добавить(СтрокаКонфигурация.Конфигурация);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Связь_Изменения_СвойстваМатрицаПрав
&НаКлиенте
Процедура ИзмененияПриАктивизацииСтроки(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	УстановитьОтборПоКлючу(ТекДанные, Элементы.СвойстваОбъекта, "Ключ");
	УстановитьОтборПоКлючу(ТекДанные, Элементы.МатрицаПрав, "Ключ");
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияПередУдалением(Элемент, Отказ)
	ОбщаяПроцедураУдалитьСтроки(Элемент.ТекущиеДанные, Объект.СвойстваОбъекта, "Ключ");
	ОбщаяПроцедураУдалитьСтроки(Элемент.ТекущиеДанные, Объект.МатрицаПрав, "Ключ");
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элемент.ТекущиеДанные;		
	Если НоваяСтрока ТОгда
		ТекДанные.Ключ = Новый УникальныйИдентификатор();
	КонецЕсли;
		
	УстановитьОтборПоКлючу(ТекДанные,Элементы.СвойстваОбъекта, "Ключ");	
	УстановитьОтборПоКлючу(ТекДанные,Элементы.МатрицаПрав, "Ключ");	
	
	Если ТекДанные.ТипОбъекта <> ТекДанные.ТипОбъектаПредыдущий Тогда
		ПерезаполнитьСвойства(ТекДанные.Ключ, ТекДанные.ТипОбъекта, ТекДанные.Действие);
		ТекДанные.ТипОбъектаПредыдущий = ТекДанные.ТипОбъекта;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКлючу(ТекДанные, ТекЭлем, НаименованиеКлюча)
	
	Если ТекДанные = Неопределено Тогда
 		Возврат;
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", ТекДанные["Ключ"]);
	ТекЭлем.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбщаяПроцедураУдалитьСтроки(ТекДанные, ТекЭлем, НаименованиеКлюча)
	Если ТекДанные <> Неопределено Тогда
		МассивСтрок = ТекЭлем.НайтиСтроки(Новый Структура (НаименованиеКлюча,ТекДанные[НаименованиеКлюча]));
		Для Каждого СтрМассива ИЗ МассивСтрок Цикл
			ТекЭлем.Удалить(СтрМассива);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСвойства(Ключ, ТипОбъекта, ДействиеСОбъектом)
	
	Если НЕ ЗначениеЗаполнено(ТипОбъекта) ТОгда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвойстваОбъектовТипыОбъектов.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.СвойстваОбъектов.ДействияСОбъектами КАК СвойстваОбъектовДействияСОбъектами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СвойстваОбъектов.ТипыОбъектов КАК СвойстваОбъектовТипыОбъектов
	               |		ПО СвойстваОбъектовДействияСОбъектами.Ссылка = СвойстваОбъектовТипыОбъектов.Ссылка
	               |ГДЕ
	               |	СвойстваОбъектовТипыОбъектов.ТипОбъекта = &ТипОбъекта
	               |	И НЕ СвойстваОбъектовТипыОбъектов.Ссылка.ПометкаУдаления
	               |	И СвойстваОбъектовДействияСОбъектами.ДействиеСОбъектом = &ДействиеСОбъектом";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ДействиеСОбъектом", ДействиеСОбъектом);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Кол = Объект.СвойстваОбъекта.Количество();
	Если Кол > 0 Тогда
		Для Н = 1 По Кол Цикл
			Если Объект.СвойстваОбъекта[Кол-Н].Ключ = Ключ Тогда
				Объект.СвойстваОбъекта.Удалить(Объект.СвойстваОбъекта[Кол-Н]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Нов = Объект.СвойстваОбъекта.Добавить();
		Нов.Ключ = Ключ;
		Нов.Свойство = Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПравПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.Изменения.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатрицаПравПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные.Ключ = Элементы.Изменения.ТекущиеДанные.Ключ;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область МножественныйПодборОбъектов
&НаКлиенте
Процедура ПодборОбъектов(Команда)
	
	СписокКонфигураций = Новый СписокЗначений;
	Для каждого Элемент Из Объект.Конфигурации Цикл
		СписокКонфигураций.Добавить(Элемент.Конфигурация);
	КонецЦикла;	
	
	ОткрытьФорму("Справочник.ОбъектыМетаданных.ФормаВыбора", Новый Структура("СписокКонфигураций,МножественныйВыбор,РежимВыбора,ЗакрыватьПриВыборе", СписокКонфигураций, Истина, Истина, Ложь), Элементы.Изменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Элемент Из ВыбранноеЗначение Цикл
			ДобавитьОбъектИзменений(Элемент);			
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ОбъектыМетаданных") Тогда
		ДобавитьОбъектИзменений(ВыбранноеЗначение);			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОбъектИзменений(ОбъектСсылка) 
	
	Реквизиты = ЗначениеРеквизитовОбъекта(ОбъектСсылка, "Владелец.Платформа,Владелец,ТипОбъекта");
	Нов = Объект.Изменения.Добавить();
	Нов.Действие = ПредопределенноеЗначение("Справочник.ДействияСОбъектами.Изменение");
	Нов.Конфигурация = Реквизиты.Владелец; 
	Нов.ТипОбъекта = Реквизиты.ТипОбъекта;
	Нов.Объект = ОбъектСсылка;
	Нов.Платформа = Реквизиты.ВладелецПлатформа; 
	Нов.Ключ = Новый УникальныйИдентификатор;
	
	ПерезаполнитьСвойства(Нов.Ключ, Нов.ТипОбъекта, Нов.Действие);  
	
КонецПроцедуры

#КонецОбласти
